swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_pinmux.c
/**************************************************************************//**
 * @file     rtl8735b_pinmux.c
 * @brief    Implement function to detect pin-mux conflict.
 * @version  V1.00
 * @date     2021-07-17
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2020 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#include "cmsis.h"
#include "rtl8735b.h"



#define SECTION_PINMUX_TEXT           SECTION(".rom.hal_pinmux.text")
#define SECTION_PINMUX_DATA           SECTION(".rom.hal_pinmux.data")
#define SECTION_PINMUX_RODATA         SECTION(".rom.hal_pinmux.rodata")
#define SECTION_PINMUX_BSS            SECTION(".rom.hal_pinmux.bss")
#define SECTION_PINMUX_STUBS          SECTION(".rom.hal_pinmux.stubs")


#define GPIO_CTRL_PINMUX_SEL_OFFSET_H       16
#define GPIO_CTRL_PINMUX_SEL_OFFSET_L       0




/**
  * @brief The table of GPIO A control registers.
  */
SECTION_PINMUX_RODATA
const __IOM uint32_t *gpio_a_ctrl_reg_list[] = {
	&(AON->AON_REG_AON_GPIOA_0_1_CTRL),
	&(AON->AON_REG_AON_GPIOA_2_3_CTRL),
	&(AON->AON_REG_AON_GPIOA_4_5_CTRL)
};

/**
  * @brief The table of GPIO B control registers.
  */
SECTION_PINMUX_RODATA
const __IOM uint32_t *gpio_b_ctrl_reg_list[] = {
	&(SYSON->SYSON_REG_SYSON_GPIOB_0_1_CTRL),
	&(SYSON->SYSON_REG_SYSON_GPIOB_2_CTRL)
};

/**
  * @brief The table of GPIO C control registers.
  */
SECTION_PINMUX_RODATA
const __IOM uint32_t *gpio_c_ctrl_reg_list[] = {
	&(SYSON->SYSON_REG_SYSON_GPIOC_0_1_CTRL),
	&(SYSON->SYSON_REG_SYSON_GPIOC_2_3_CTRL),
	&(SYSON->SYSON_REG_SYSON_GPIOC_4_5_CTRL)
};

/**
  * @brief The table of GPIO D control registers.
  */
SECTION_PINMUX_RODATA
const __IOM uint32_t *gpio_d_ctrl_reg_list[] = {
	&(SYSON->SYSON_REG_SYSON_GPIOD_0_1_CTRL),
	&(SYSON->SYSON_REG_SYSON_GPIOD_2_3_CTRL),
	&(SYSON->SYSON_REG_SYSON_GPIOD_4_5_CTRL),
	&(SYSON->SYSON_REG_SYSON_GPIOD_6_7_CTRL),
	&(SYSON->SYSON_REG_SYSON_GPIOD_8_9_CTRL),
	&(SYSON->SYSON_REG_SYSON_GPIOD_10_11_CTRL),
	&(SYSON->SYSON_REG_SYSON_GPIOD_12_13_CTRL),
	&(SYSON->SYSON_REG_SYSON_GPIOD_14_15_CTRL),
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	&(SYSON->SYSON_REG_SYSON_GPIOD_16_CTRL)
#else
	&(SYSON->SYSON_REG_SYSON_GPIOD_16_17_CTRL),
	&(SYSON->SYSON_REG_SYSON_GPIOD_18_19_CTRL),
	&(SYSON->SYSON_REG_SYSON_GPIOD_20_CTRL)
#endif
};

/**
  * @brief The table of GPIO E control registers.
  */
SECTION_PINMUX_RODATA
const __IOM uint32_t *gpio_e_ctrl_reg_list[] = {
	&(SYSON->SYSON_REG_SYSON_GPIOE_0_1_CTRL),
	&(SYSON->SYSON_REG_SYSON_GPIOE_2_3_CTRL),
	&(SYSON->SYSON_REG_SYSON_GPIOE_4_5_CTRL),
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	&(SYSON->SYSON_REG_SYSON_GPIOE_6_7_CTRL),
	&(SYSON->SYSON_REG_SYSON_GPIOE_8_9_CTRL),
	&(SYSON->SYSON_REG_SYSON_GPIOE_10_CTRL)
#else
	&(SYSON->SYSON_REG_SYSON_GPIOE_6_CTRL)
#endif
};

/**
  * @brief The table of GPIO F control registers.
  */
SECTION_PINMUX_RODATA
const __IOM uint32_t *gpio_f_ctrl_reg_list[] = {
	&(PON->PON_REG_PON_GPIOF_0_1_CTRL),
	&(PON->PON_REG_PON_GPIOF_2_3_CTRL),
	&(PON->PON_REG_PON_GPIOF_4_5_CTRL),
	&(PON->PON_REG_PON_GPIOF_6_7_CTRL),
	&(PON->PON_REG_PON_GPIOF_8_9_CTRL),
	&(PON->PON_REG_PON_GPIOF_10_11_CTRL),
	&(PON->PON_REG_PON_GPIOF_12_13_CTRL),
	&(PON->PON_REG_PON_GPIOF_14_15_CTRL),
	&(PON->PON_REG_PON_GPIOF_16_17_CTRL)
};

/**
  * @brief The table of GPIO S control registers.
  */
SECTION_PINMUX_RODATA
const __IOM uint32_t *gpio_s_ctrl_reg_list[] = {
	&(SYSON->SYSON_REG_SYSON_GPIOS_0_1_CTRL),
	&(SYSON->SYSON_REG_SYSON_GPIOS_2_3_CTRL),
	&(SYSON->SYSON_REG_SYSON_GPIOS_4_5_CTRL),
	&(SYSON->SYSON_REG_SYSON_GPIOS_6_CTRL)
};

/**
  * @brief The string table of IO function name.
  */
SECTION_PINMUX_RODATA
const char *io_func_name_string[] = {
	"Primary",
	"DMIC/I2C",
	"PWM",
	"RFAFE_CTRL/JTAG",
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	"TPIU/BT_AOX",
#else
	"SDIO Host/BT_AOX",
#endif
	"SPI Master/I2S",
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	"SDIO Host/UART",
#else
	"TPIU/UART",
#endif
	"BT",
	"SPI Slave",
	"External BT",
	"Undefined Func Group",
	"Undefined Func Group",
	"Undefined Func Group",
	"Undefined Func Group",
	"Undefined Func Group",
	"GPIO"
};

/**
  * @brief The table of pinmux selection.
  */
SECTION_PINMUX_RODATA
const __IOM hal_pinmux_sel_t pinmux_sel_tbl[] = {
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	{PIN_A0,  PIN_B0,  PIN_LIST_END},  // I2C0_SCL
	{PIN_A1,  PIN_B1,  PIN_LIST_END},  // I2C0_SDA
	{PIN_D15, PIN_F2,  PIN_LIST_END},  // I2C1_SCL
	{PIN_D16, PIN_F3,  PIN_LIST_END},  // I2C1_SDA
	{PIN_E7,  PIN_E9,  PIN_LIST_END},  // I2C2_SCL
	{PIN_E8,  PIN_E10, PIN_LIST_END},  // I2C2_SDA
	{PIN_E0,  PIN_E2,  PIN_LIST_END},  // DMIC_CLK
	{PIN_F1,  PIN_F14, PIN_LIST_END},  // SGPIO_RX
	{PIN_D14, PIN_E3,  PIN_LIST_END},  // WIFI_LED
	{PIN_F14, PIN_S1,  PIN_LIST_END},  // PWM8
	{PIN_F15, PIN_S4,  PIN_LIST_END},  // PWM9
	{PIN_F16, PIN_S5,  PIN_LIST_END},  // PWM10
	{PIN_F17, PIN_S6,  PIN_LIST_END},  // PWM11
	{PIN_A1,  PIN_F10, PIN_LIST_END},  // JTAG_CLK/SWD_CK
	{PIN_A0,  PIN_F11, PIN_LIST_END},  // JTAG_TMS/SWD_IO
	{PIN_D15, PIN_E4,  PIN_LIST_END},  // RFE_CTRL_3
	{PIN_D16, PIN_E7,  PIN_LIST_END},  // RFE_CTRL_4
	{PIN_E3,  PIN_E8,  PIN_LIST_END},  // RFE_CTRL_5
	{PIN_E1,  PIN_E5,  PIN_LIST_END},  // BT_AOX_0
	{PIN_E2,  PIN_E6,  PIN_LIST_END},  // BT_AOX_1
	{PIN_E3,  PIN_E7,  PIN_LIST_END},  // BT_AOX_2
	{PIN_E4,  PIN_E8,  PIN_LIST_END},  // BT_AOX_3
	{PIN_F4,  PIN_F12, PIN_LIST_END},  // UART1_IN
	{PIN_F5,  PIN_F13, PIN_LIST_END},  // UART1_OUT
	{PIN_D16, PIN_E2,  PIN_LIST_END},  // UART2_IN
	{PIN_D15, PIN_E1,  PIN_LIST_END},  // UART2_OUT
	{PIN_D13, PIN_E0,  PIN_E6},        // BT_UART_IN
	{PIN_D11, PIN_E1,  PIN_E5}         // BT_UART_OUT
#else
	{PIN_A0,  PIN_B0,  PIN_LIST_END},  // I2C0_SCL
	{PIN_A1,  PIN_B1,  PIN_LIST_END},  // I2C0_SDA
	{PIN_D19, PIN_F1,  PIN_LIST_END},  // I2C1_SCL
	{PIN_D20, PIN_F2,  PIN_LIST_END},  // I2C1_SDA
	{PIN_E3,  PIN_E5,  PIN_LIST_END},  // I2C2_SCL
	{PIN_E4,  PIN_E6,  PIN_LIST_END},  // I2C2_SDA
	{PIN_D14, PIN_D16, PIN_LIST_END},  // DMIC_CLK
	{PIN_F9,  PIN_F14, PIN_LIST_END},  // SGPIO_RX
	{PIN_D14, PIN_E0,  PIN_LIST_END},  // WIFI_LED
	{PIN_F14, PIN_S1,  PIN_LIST_END},  // PWM8
	{PIN_F15, PIN_S4,  PIN_LIST_END},  // PWM9
	{PIN_F16, PIN_S5,  PIN_LIST_END},  // PWM10
	{PIN_F17, PIN_S6,  PIN_LIST_END},  // PWM11
	{PIN_A1,  PIN_F9,  PIN_LIST_END},  // JTAG_CLK/SWD_CK
	{PIN_A0,  PIN_F10, PIN_LIST_END},  // JTAG_TMS/SWD_IO
	{PIN_D19, PIN_E0,  PIN_LIST_END},  // RFE_CTRL_3
	{PIN_D17, PIN_E3,  PIN_LIST_END},  // RFE_CTRL_4
	{PIN_D18, PIN_E4,  PIN_LIST_END},  // RFE_CTRL_5
	{PIN_D15, PIN_E1,  PIN_LIST_END},  // BT_AOX_0
	{PIN_D16, PIN_E2,  PIN_LIST_END},  // BT_AOX_1
	{PIN_D17, PIN_E3,  PIN_LIST_END},  // BT_AOX_2
	{PIN_D18, PIN_E4,  PIN_LIST_END},  // BT_AOX_3
	{PIN_F3,  PIN_F12, PIN_LIST_END},  // UART1_IN
	{PIN_F4,  PIN_F13, PIN_LIST_END},  // UART1_OUT
	{PIN_D16, PIN_D20, PIN_LIST_END},  // UART2_IN
	{PIN_D15, PIN_D19, PIN_E0},        // UART2_OUT
	{PIN_D12, PIN_D14, PIN_E2},        // BT_UART_IN
	{PIN_D10, PIN_D15, PIN_E1},        // BT_UART_OUT
	{PIN_D13, PIN_E0,  PIN_LIST_END}   // BT_LOG
#endif
};


/**
  * @brief Point to the global pin mux management adapter.
  */
SECTION_PINMUX_BSS hal_pin_mux_mang_t *ppinmux_manager;
SECTION_PINMUX_BSS uint32_t pinmux_reg_rec[PORT_MAX_NUM][32];

#if IS_AFTER_CUT_A(CONFIG_CHIP_VER)
SECTION_PINMUX_BSS uint32_t pinmux_pwr_log[PORT_MAX_NUM];
SECTION_PINMUX_BSS uint32_t pinmux_reg_log[PORT_MAX_NUM];
#endif

/**
  * @brief The stubs functions table to exports pin mux management ROM HAL functions.
  */
SECTION_PINMUX_STUBS const hal_pin_manag_func_stubs_t hal_pin_manag_stubs = {
	.pppin_manager = &ppinmux_manager,
	.hal_pinmux_manager_init = hal_rtl_pinmux_manager_init,
	.hal_pin_register = hal_rtl_pin_register,
	.hal_pin_unregister = hal_rtl_pin_unregister,
	.hal_pin_mux_cfg = hal_rtl_pin_mux_cfg,
	.hal_pin_get_cfg = hal_rtl_pin_get_cfg,
	.hal_pin_pwrup = hal_rtl_pin_pwrup,
	.hal_pin_pwrdwn = hal_rtl_pin_pwrdwn,
	.hal_pinmux_register = hal_rtl_pinmux_register,
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	.hal_pinmux_unregister = hal_rtl_pinmux_unregister
#else
	.hal_pinmux_unregister = hal_rtl_pinmux_unregister,
	.hal_pinmux_rom_info_manage = hal_rtl_pinmux_rom_info_manage,
#endif
};

/**
 *  @brief To initial the pin mux manager.
 *
 *  @param[in] pinmux_manag The pin mux manager entity.
 *
 *  @returns void
 */
SECTION_PINMUX_TEXT
void hal_rtl_pinmux_manager_init(hal_pin_mux_mang_t *pinmux_manag)
{
	AON_TypeDef *aon = AON;


