swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_pinmux.c
	pinmux_manag->ppinmux_reg_rec = &pinmux_reg_rec[0][0];
	ppinmux_manager = pinmux_manag;
	if (((aon->AON_REG_AON_PAD_CTRL) & AON_BIT_AON_GPIOA_PWD33) == 0) {
		ppinmux_manager->pinmux_pwr_log[PORT_A] = (1 << 5) | (1 << 4);
	}
}


SECTION_PINMUX_TEXT
uint8_t _hal_rtl_pin_reg_chk(uint32_t pin_name, uint32_t periphl_id)
{
	io_pin_t pin;
	uint32_t port_idx;
	uint32_t pin_idx;


	pin.pin_name = pin_name;
	port_idx = pin.pin_name_b.port;
	pin_idx = pin.pin_name_b.pin;

	if (ppinmux_manager->pinmux_reg_log[port_idx] & (1 << pin_idx)) {
		if ((ppinmux_manager->ppinmux_reg_rec[(port_idx << 5) + pin_idx]) == periphl_id) {
			DBG_MISC_ERR("Peripheral[%08X] is already used by Pin%d[%d]\r\n", periphl_id, port_idx, pin_idx);
			return 1;
		} else {
			return 0;
		}
	} else {
		return 0;
	}
}


/**
 *  @brief To check the pinmux selection conflict by peripheral ID.
 *
 *  @param[in]  pin_name  The IO pin.
 *  @param[in]  periphl_id  The ID of the peripheral will use this pin.
 *
 *  @return     HAL_OK:  Pin selection OK.
 *  @return     HAL_ERR_CONFLICT:  Pin selection conflict. The specified pin/peripheral ID
 *              is occupied by other pin.
 */
SECTION_PINMUX_TEXT
hal_status_t _hal_rtl_pinmux_sel_chk(uint32_t pin_name, uint32_t periphl_id)
{
	uint8_t is_conflict = 0;
	uint8_t chk1 = 0;
	uint8_t chk2 = 0;


	switch (periphl_id) {
	case PID_I2C0:
		if (pin_name == pinmux_sel_tbl[0].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[0].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[0].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[0].pin_sel_0, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[1].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[1].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[1].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[1].pin_sel_0, periphl_id);
		} else {
			is_conflict = 0;
		}
		break;
	case PID_I2C1:
		if (pin_name == pinmux_sel_tbl[2].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[2].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[2].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[2].pin_sel_0, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[3].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[3].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[3].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[3].pin_sel_0, periphl_id);
		} else {
			is_conflict = 0;
		}
		break;
	case PID_I2C2:
		if (pin_name == pinmux_sel_tbl[4].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[4].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[4].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[4].pin_sel_0, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[5].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[5].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[5].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[5].pin_sel_0, periphl_id);
		} else {
			is_conflict = 0;
		}
		break;
	case PID_DMIC:
		if (pin_name == pinmux_sel_tbl[6].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[6].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[6].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[6].pin_sel_0, periphl_id);
		} else {
			is_conflict = 0;
		}
		break;
	case PID_SGPIO:
		if (pin_name == pinmux_sel_tbl[7].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[7].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[7].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[7].pin_sel_0, periphl_id);
		} else {
			is_conflict = 0;
		}
		break;
	case PID_WLAN_LED:
		if (pin_name == pinmux_sel_tbl[8].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[8].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[8].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[8].pin_sel_0, periphl_id);
		} else {
			is_conflict = 0;
		}
		break;
	case PID_PWM8:
		if (pin_name == pinmux_sel_tbl[9].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[9].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[9].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[9].pin_sel_0, periphl_id);
		} else {
			is_conflict = 0;
		}
		break;
	case PID_PWM9:
		if (pin_name == pinmux_sel_tbl[10].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[10].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[10].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[10].pin_sel_0, periphl_id);
		} else {
			is_conflict = 0;
		}
		break;
	case PID_PWM10:
		if (pin_name == pinmux_sel_tbl[11].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[11].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[11].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[11].pin_sel_0, periphl_id);
		} else {
			is_conflict = 0;
		}
		break;
	case PID_PWM11:
		if (pin_name == pinmux_sel_tbl[12].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[12].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[12].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[12].pin_sel_0, periphl_id);
		} else {
			is_conflict = 0;
		}
		break;
	case PID_JTAG:
		if (pin_name == pinmux_sel_tbl[13].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[13].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[13].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[13].pin_sel_0, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[14].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[14].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[14].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[14].pin_sel_0, periphl_id);
		} else {
			is_conflict = 0;
		}
		break;
	case PID_RFE_CTRL:
		if (pin_name == pinmux_sel_tbl[15].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[15].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[15].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[15].pin_sel_0, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[16].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[16].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[16].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[16].pin_sel_0, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[17].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[17].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[17].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[17].pin_sel_0, periphl_id);
		} else {
			is_conflict = 0;
		}
		break;
	case PID_BT_AOX:
		if (pin_name == pinmux_sel_tbl[18].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[18].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[18].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[18].pin_sel_0, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[19].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[19].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[19].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[19].pin_sel_0, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[20].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[20].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[20].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[20].pin_sel_0, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[21].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[21].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[21].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[21].pin_sel_0, periphl_id);
		} else {
			is_conflict = 0;
		}
		break;
	case PID_UART1:
		if (pin_name == pinmux_sel_tbl[22].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[22].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[22].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[22].pin_sel_0, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[23].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[23].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[23].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[23].pin_sel_0, periphl_id);
		} else {
			is_conflict = 0;
		}
		break;
	case PID_UART2:
#if IS_CUT_TEST(CONFIG_CHIP_VER)
		if (pin_name == pinmux_sel_tbl[24].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[24].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[24].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[24].pin_sel_0, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[25].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[25].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[25].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[25].pin_sel_0, periphl_id);
		} else {
			is_conflict = 0;
		}
#else
		if (pin_name == pinmux_sel_tbl[24].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[24].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[24].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[24].pin_sel_0, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[25].pin_sel_0) {
			chk1 = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[25].pin_sel_1, periphl_id);
			chk2 = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[25].pin_sel_2, periphl_id);
			if ((!chk1) && (!chk2)) {
				is_conflict = 0;
			} else {
				is_conflict = 1;
			}
		} else if (pin_name == pinmux_sel_tbl[25].pin_sel_1) {
			chk1 = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[25].pin_sel_0, periphl_id);
			chk2 = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[25].pin_sel_2, periphl_id);
			if ((!chk1) && (!chk2)) {
				is_conflict = 0;
			} else {
				is_conflict = 1;
			}
		} else if (pin_name == pinmux_sel_tbl[25].pin_sel_2) {
			chk1 = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[25].pin_sel_0, periphl_id);
			chk2 = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[25].pin_sel_1, periphl_id);
			if ((!chk1) && (!chk2)) {
				is_conflict = 0;
			} else {
				is_conflict = 1;
			}
		} else {
			is_conflict = 0;
		}
#endif
		break;
	case PID_BT_UART:
		if (pin_name == pinmux_sel_tbl[26].pin_sel_0) {
			chk1 = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[26].pin_sel_1, periphl_id);
			chk2 = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[26].pin_sel_2, periphl_id);
			if ((!chk1) && (!chk2)) {
				is_conflict = 0;
			} else {
				is_conflict = 1;
			}
		} else if (pin_name == pinmux_sel_tbl[26].pin_sel_1) {
			chk1 = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[26].pin_sel_0, periphl_id);
			chk2 = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[26].pin_sel_2, periphl_id);
			if ((!chk1) && (!chk2)) {
				is_conflict = 0;
			} else {
				is_conflict = 1;
			}
		} else if (pin_name == pinmux_sel_tbl[26].pin_sel_2) {
			chk1 = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[26].pin_sel_0, periphl_id);
			chk2 = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[26].pin_sel_1, periphl_id);
			if ((!chk1) && (!chk2)) {
				is_conflict = 0;
			} else {
				is_conflict = 1;
			}
		} else if (pin_name == pinmux_sel_tbl[27].pin_sel_0) {
			chk1 = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[27].pin_sel_1, periphl_id);
			chk2 = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[27].pin_sel_2, periphl_id);
			if ((!chk1) && (!chk2)) {
				is_conflict = 0;
			} else {
				is_conflict = 1;
			}
		} else if (pin_name == pinmux_sel_tbl[27].pin_sel_1) {
			chk1 = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[27].pin_sel_0, periphl_id);
			chk2 = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[27].pin_sel_2, periphl_id);
			if ((!chk1) && (!chk2)) {
				is_conflict = 0;
			} else {
				is_conflict = 1;
			}
		} else if (pin_name == pinmux_sel_tbl[27].pin_sel_2) {
			chk1 = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[27].pin_sel_0, periphl_id);
			chk2 = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[27].pin_sel_1, periphl_id);
			if ((!chk1) && (!chk2)) {
				is_conflict = 0;
			} else {
				is_conflict = 1;
			}
		} else {
			is_conflict = 0;
		}
		break;
#if !IS_CUT_TEST(CONFIG_CHIP_VER)
	case PID_BT_LOG:
		if (pin_name == pinmux_sel_tbl[28].pin_sel_0) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[28].pin_sel_1, periphl_id);
		} else if (pin_name == pinmux_sel_tbl[28].pin_sel_1) {
			is_conflict = _hal_rtl_pin_reg_chk(pinmux_sel_tbl[28].pin_sel_0, periphl_id);
		} else {
			is_conflict = 0;
		}
		break;
#endif
	default:
		is_conflict = 0;
		break;
	}

	if (is_conflict) {
		return HAL_ERR_CONFLICT;
	} else {
		return HAL_OK;
	}
}


/**
 *  @brief To register a IO pin to the "in using" record.
 *
 *  @param[in]  pin_name  The IO pin.
 *  @param[in]  periphl_id  The ID of the peripheral will use this pin.
 *
 *  @return     HAL_OK:  Pin register OK.
 *  @return     HAL_ERR_CONFLICT:  Pin conflict. The specified pin
 *              is occupied by other peripheral device.
 */
SECTION_PINMUX_TEXT
hal_status_t hal_rtl_pin_register(uint32_t pin_name, uint32_t periphl_id)
{
	io_pin_t pin;
	uint32_t port_idx;
	uint32_t pin_idx;
	uint8_t pinmux_sel;


	DBG_MISC_INFO("\r\n%s => pin_name = 0x%x, pid = 0x%x\r\n", __func__, pin_name, periphl_id);
	pin.pin_name = pin_name;
	port_idx = pin.pin_name_b.port;
	pin_idx = pin.pin_name_b.pin;

	if (port_idx >= PORT_MAX_NUM) {
		// Internal Port ?
		if (port_idx == PORT_INTERNAL) {
			return HAL_OK;
		} else {
			DBG_MISC_ERR("hal_rtl_pin_register: Unknown port (%u)\r\n", port_idx);
			return HAL_ERR_PARA;
		}
	}

