swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_pinmux.c
	// pinmux selection conflict
	if (_hal_rtl_pinmux_sel_chk(pin_name, periphl_id) != HAL_OK) {
		return HAL_ERR_CONFLICT;
	}

	// pin confict
	if (ppinmux_manager->pinmux_reg_log[port_idx] & (1 << pin_idx)) {
		DBG_MISC_ERR("Pin %u[%u] is conflicted\r\n", port_idx, pin_idx);

		if (port_idx == PORT_DDR) {
			DBG_MISC_ERR("It's configured as DDR now.\r\n");
		} else {
			switch (port_idx) {
			case PORT_A:
				if (pin_idx % 2) {
					// pin index is odd
					pinmux_sel = ((*((uint32_t *)(gpio_a_ctrl_reg_list[(pin_idx >> 1)]))) >> GPIO_CTRL_PINMUX_SEL_OFFSET_H) & 0xF;  // bit[19:16]
				} else {
					// pin index is even
					pinmux_sel = (*((uint32_t *)(gpio_a_ctrl_reg_list[(pin_idx >> 1)]))) & 0xF;  // bit[3:0]
				}
				break;
			case PORT_B:
				if (pin_idx % 2) {
					// pin index is odd
					pinmux_sel = ((*((uint32_t *)(gpio_b_ctrl_reg_list[(pin_idx >> 1)]))) >> GPIO_CTRL_PINMUX_SEL_OFFSET_H) & 0xF;  // bit[19:16]
				} else {
					// pin index is even
					pinmux_sel = (*((uint32_t *)(gpio_b_ctrl_reg_list[(pin_idx >> 1)]))) & 0xF;  // bit[3:0]
				}
				break;
			case PORT_C:
				if (pin_idx % 2) {
					// pin index is odd
					pinmux_sel = ((*((uint32_t *)(gpio_c_ctrl_reg_list[(pin_idx >> 1)]))) >> GPIO_CTRL_PINMUX_SEL_OFFSET_H) & 0xF;  // bit[19:16]
				} else {
					// pin index is even
					pinmux_sel = (*((uint32_t *)(gpio_c_ctrl_reg_list[(pin_idx >> 1)]))) & 0xF;  // bit[3:0]
				}
				break;
			case PORT_D:
				if (pin_idx % 2) {
					// pin index is odd
					pinmux_sel = ((*((uint32_t *)(gpio_d_ctrl_reg_list[(pin_idx >> 1)]))) >> GPIO_CTRL_PINMUX_SEL_OFFSET_H) & 0xF;  // bit[19:16]
				} else {
					// pin index is even
					pinmux_sel = (*((uint32_t *)(gpio_d_ctrl_reg_list[(pin_idx >> 1)]))) & 0xF;  // bit[3:0]
				}
				break;
			case PORT_E:
				if (pin_idx % 2) {
					// pin index is odd
					pinmux_sel = ((*((uint32_t *)(gpio_e_ctrl_reg_list[(pin_idx >> 1)]))) >> GPIO_CTRL_PINMUX_SEL_OFFSET_H) & 0xF;  // bit[19:16]
				} else {
					// pin index is even
					pinmux_sel = (*((uint32_t *)(gpio_e_ctrl_reg_list[(pin_idx >> 1)]))) & 0xF;  // bit[3:0]
				}
				break;
			case PORT_F:
				if (pin_idx % 2) {
					// pin index is odd
					pinmux_sel = ((*((uint32_t *)(gpio_f_ctrl_reg_list[(pin_idx >> 1)]))) >> GPIO_CTRL_PINMUX_SEL_OFFSET_H) & 0xF;  // bit[19:16]
				} else {
					// pin index is even
					pinmux_sel = (*((uint32_t *)(gpio_f_ctrl_reg_list[(pin_idx >> 1)]))) & 0xF;  // bit[3:0]
				}
				break;
			case PORT_S:
				if (pin_idx % 2) {
					// pin index is odd
					pinmux_sel = ((*((uint32_t *)(gpio_s_ctrl_reg_list[(pin_idx >> 1)]))) >> GPIO_CTRL_PINMUX_SEL_OFFSET_H) & 0xF;  // bit[19:16]
				} else {
					// pin index is even
					pinmux_sel = (*((uint32_t *)(gpio_s_ctrl_reg_list[(pin_idx >> 1)]))) & 0xF;  // bit[3:0]
				}
				break;
			default:
				break;
			}
			DBG_MISC_ERR("It's configured as %s now.\r\n", io_func_name_string[pinmux_sel]);
		}
		if (ppinmux_manager->ppinmux_reg_rec[(port_idx << 5) + pin_idx]) {
			DBG_MISC_ERR("It's using by peripheral %08X\r\n", ppinmux_manager->ppinmux_reg_rec[(port_idx << 5) + pin_idx]);
		}

		return HAL_ERR_CONFLICT;
	}

	// no pin conflict, mark pin using bits
	ppinmux_manager->pinmux_reg_log[port_idx] |= (1 << pin_idx);
	ppinmux_manager->ppinmux_reg_rec[(port_idx << 5) + pin_idx] = periphl_id;


	return HAL_OK;
}


/**
 *  @brief To unregister a IO pin from the "in using" record.
 *
 *  @param[in]  pin_name  The IO pin.
 *  @param[in]  periphl_id  The ID of the peripheral own this pin.
 *
 *  @return     HAL_OK:  Pin unregister OK.
 *  @return     HAL_ERR_PARA:  The peripheral ID doesn't match with the ID on the "in using" record.
 */
SECTION_PINMUX_TEXT
hal_status_t hal_rtl_pin_unregister(uint32_t pin_name, uint32_t periphl_id)
{
	io_pin_t pin;
	uint32_t port_idx;
	uint32_t pin_idx;


	DBG_MISC_INFO("\r\n%s => pin_name = 0x%x, pid = 0x%x\r\n", __func__, pin_name, periphl_id);
	pin.pin_name = pin_name;
	port_idx = pin.pin_name_b.port;
	pin_idx = pin.pin_name_b.pin;

	if (port_idx >= PORT_MAX_NUM) {
		// Internal Port ?
		if (port_idx == PORT_INTERNAL) {
			return HAL_OK;
		} else {
			DBG_MISC_ERR("hal_rtl_pin_unregister: Unknown port (%u)\r\n", port_idx);
			return HAL_ERR_PARA;
		}
	}

	if (ppinmux_manager->ppinmux_reg_rec[(port_idx << 5) + pin_idx]) {
		if (periphl_id == (ppinmux_manager->ppinmux_reg_rec[(port_idx << 5) + pin_idx])) {
			ppinmux_manager->pinmux_reg_log[port_idx] &= ~(1 << pin_idx);
			ppinmux_manager->ppinmux_reg_rec[(port_idx << 5) + pin_idx] = 0;
		} else {
			DBG_MISC_ERR("Pin un-register caller (%08X) is not the owner (%08X)\r\n", periphl_id, ppinmux_manager->ppinmux_reg_rec[(port_idx << 5) + pin_idx]);
			return HAL_ERR_PARA;
		}
	} else {
		ppinmux_manager->pinmux_reg_log[port_idx] &= ~(1 << pin_idx);
	}


	return HAL_OK;
}


/**
 *  @brief Configures the pin mux to makes the given pin to connect to the specified peripheral.
 *
 *  @param[in]  pin_name  The IO pin.
 *  @param[in]  periphl_id  The ID of the peripheral will use these pins.
 *
 *  @return     HAL_OK:  Pin register OK.
 *  @return     HAL_ERR_CONFLICT:  Pin conflict. The specified pin
 *              is occupied by other peripheral device.
 */
SECTION_PINMUX_TEXT
hal_status_t hal_rtl_pin_mux_cfg(uint32_t pin_name, uint32_t periphl_id)
{
	io_pin_t pin;
	uint32_t port_idx;
	uint32_t pin_idx;
	uint8_t pin_func;


	DBG_MISC_INFO("\r\n%s => pin_name = 0x%x, pid = 0x%x\r\n", __func__, pin_name, periphl_id);
	pin.pin_name = pin_name;
	port_idx = pin.pin_name_b.port;
	pin_idx = pin.pin_name_b.pin;

	if (port_idx >= PORT_MAX_NUM) {
		// Internal Port ?
		if (port_idx == PORT_INTERNAL) {
			return HAL_OK;
		} else {
			DBG_MISC_ERR("hal_rtl_pin_mux_cfg: Unknown port (%u)\r\n", port_idx);
			return HAL_ERR_PARA;
		}
	} else if (port_idx == PORT_DDR) {
		return HAL_OK;
	}

	pin_func = (periphl_id >> 28) & 0xF;

	switch (port_idx) {
	case PORT_A:
		if (pin_idx % 2) {
			// pin index is odd
			*((uint32_t *)(gpio_a_ctrl_reg_list[(pin_idx >> 1)])) &= (~(0xF << GPIO_CTRL_PINMUX_SEL_OFFSET_H));  // clear bit[19:16]
			*((uint32_t *)(gpio_a_ctrl_reg_list[(pin_idx >> 1)])) |= (pin_func << GPIO_CTRL_PINMUX_SEL_OFFSET_H); // set bit[19:16]
		} else {
			// pin index is even
			*((uint32_t *)(gpio_a_ctrl_reg_list[(pin_idx >> 1)])) &= (~(0xF << GPIO_CTRL_PINMUX_SEL_OFFSET_L));  // clear bit[3:0]
			*((uint32_t *)(gpio_a_ctrl_reg_list[(pin_idx >> 1)])) |= (pin_func << GPIO_CTRL_PINMUX_SEL_OFFSET_L); // set bit[3:0]
		}
		break;
	case PORT_B:
		if (pin_idx % 2) {
			// pin index is odd
			*((uint32_t *)(gpio_b_ctrl_reg_list[(pin_idx >> 1)])) &= (~(0xF << GPIO_CTRL_PINMUX_SEL_OFFSET_H));  // clear bit[19:16]
			*((uint32_t *)(gpio_b_ctrl_reg_list[(pin_idx >> 1)])) |= (pin_func << GPIO_CTRL_PINMUX_SEL_OFFSET_H); // set bit[19:16]
		} else {
			// pin index is even
			*((uint32_t *)(gpio_b_ctrl_reg_list[(pin_idx >> 1)])) &= (~(0xF << GPIO_CTRL_PINMUX_SEL_OFFSET_L));  // clear bit[3:0]
			*((uint32_t *)(gpio_b_ctrl_reg_list[(pin_idx >> 1)])) |= (pin_func << GPIO_CTRL_PINMUX_SEL_OFFSET_L); // set bit[3:0]
		}
		break;
	case PORT_C:
		if (pin_idx % 2) {
			// pin index is odd
			*((uint32_t *)(gpio_c_ctrl_reg_list[(pin_idx >> 1)])) &= (~(0xF << GPIO_CTRL_PINMUX_SEL_OFFSET_H));  // clear bit[19:16]
			*((uint32_t *)(gpio_c_ctrl_reg_list[(pin_idx >> 1)])) |= (pin_func << GPIO_CTRL_PINMUX_SEL_OFFSET_H); // set bit[19:16]
		} else {
			// pin index is even
			*((uint32_t *)(gpio_c_ctrl_reg_list[(pin_idx >> 1)])) &= (~(0xF << GPIO_CTRL_PINMUX_SEL_OFFSET_L));  // clear bit[3:0]
			*((uint32_t *)(gpio_c_ctrl_reg_list[(pin_idx >> 1)])) |= (pin_func << GPIO_CTRL_PINMUX_SEL_OFFSET_L); // set bit[3:0]
		}
		break;
	case PORT_D:
		if (pin_idx % 2) {
			// pin index is odd
			*((uint32_t *)(gpio_d_ctrl_reg_list[(pin_idx >> 1)])) &= (~(0xF << GPIO_CTRL_PINMUX_SEL_OFFSET_H));  // clear bit[19:16]
			*((uint32_t *)(gpio_d_ctrl_reg_list[(pin_idx >> 1)])) |= (pin_func << GPIO_CTRL_PINMUX_SEL_OFFSET_H); // set bit[19:16]
		} else {
			// pin index is even
			*((uint32_t *)(gpio_d_ctrl_reg_list[(pin_idx >> 1)])) &= (~(0xF << GPIO_CTRL_PINMUX_SEL_OFFSET_L));  // clear bit[3:0]
			*((uint32_t *)(gpio_d_ctrl_reg_list[(pin_idx >> 1)])) |= (pin_func << GPIO_CTRL_PINMUX_SEL_OFFSET_L); // set bit[3:0]
		}
		break;
	case PORT_E:
		if (pin_idx % 2) {
			// pin index is odd
			*((uint32_t *)(gpio_e_ctrl_reg_list[(pin_idx >> 1)])) &= (~(0xF << GPIO_CTRL_PINMUX_SEL_OFFSET_H));  // clear bit[19:16]
			*((uint32_t *)(gpio_e_ctrl_reg_list[(pin_idx >> 1)])) |= (pin_func << GPIO_CTRL_PINMUX_SEL_OFFSET_H); // set bit[19:16]
		} else {
			// pin index is even
			*((uint32_t *)(gpio_e_ctrl_reg_list[(pin_idx >> 1)])) &= (~(0xF << GPIO_CTRL_PINMUX_SEL_OFFSET_L));  // clear bit[3:0]
			*((uint32_t *)(gpio_e_ctrl_reg_list[(pin_idx >> 1)])) |= (pin_func << GPIO_CTRL_PINMUX_SEL_OFFSET_L); // set bit[3:0]
		}
		break;
	case PORT_F:
		if (pin_idx % 2) {
			// pin index is odd
			*((uint32_t *)(gpio_f_ctrl_reg_list[(pin_idx >> 1)])) &= (~(0xF << GPIO_CTRL_PINMUX_SEL_OFFSET_H));  // clear bit[19:16]
			*((uint32_t *)(gpio_f_ctrl_reg_list[(pin_idx >> 1)])) |= (pin_func << GPIO_CTRL_PINMUX_SEL_OFFSET_H); // set bit[19:16]
		} else {
			// pin index is even
			*((uint32_t *)(gpio_f_ctrl_reg_list[(pin_idx >> 1)])) &= (~(0xF << GPIO_CTRL_PINMUX_SEL_OFFSET_L));  // clear bit[3:0]
			*((uint32_t *)(gpio_f_ctrl_reg_list[(pin_idx >> 1)])) |= (pin_func << GPIO_CTRL_PINMUX_SEL_OFFSET_L); // set bit[3:0]
		}
		break;
	case PORT_S:
		if (pin_idx % 2) {
			// pin index is odd
			*((uint32_t *)(gpio_s_ctrl_reg_list[(pin_idx >> 1)])) &= (~(0xF << GPIO_CTRL_PINMUX_SEL_OFFSET_H));  // clear bit[19:16]
			*((uint32_t *)(gpio_s_ctrl_reg_list[(pin_idx >> 1)])) |= (pin_func << GPIO_CTRL_PINMUX_SEL_OFFSET_H); // set bit[19:16]
		} else {
			// pin index is even
			*((uint32_t *)(gpio_s_ctrl_reg_list[(pin_idx >> 1)])) &= (~(0xF << GPIO_CTRL_PINMUX_SEL_OFFSET_L));  // clear bit[3:0]
			*((uint32_t *)(gpio_s_ctrl_reg_list[(pin_idx >> 1)])) |= (pin_func << GPIO_CTRL_PINMUX_SEL_OFFSET_L); // set bit[3:0]
		}
		break;
	default:
		break;
	}


	return HAL_OK;
}


/**
 *  @brief Gets current pin configuration for a given pin name.
 *
 *  @param[in]  pin_name  The IO pin.
 *  @param[out]  pin_cfg  The pin configuration of the given pin name.
 *
 *  @return     HAL_OK:  get pin configuration OK.
 *  @return     HAL_ERR_PARA:  Invalid pin name.
 */
SECTION_PINMUX_TEXT
hal_status_t hal_rtl_pin_get_cfg(uint32_t pin_name, hal_pin_cfg_t *pin_cfg)
{
	io_pin_t pin;
	uint32_t port_idx;
	uint32_t pin_idx;


	pin.pin_name = pin_name;
	port_idx = pin.pin_name_b.port;
	pin_idx = pin.pin_name_b.pin;

	if (port_idx >= PORT_MAX_NUM) {
		DBG_MISC_ERR("hal_rtl_pin_get_cfg: Unknown port (%u)\r\n", port_idx);
		return HAL_ERR_PARA;
	} else if (port_idx == PORT_DDR) {
		return HAL_OK;
	}

	switch (port_idx) {
	case PORT_A:
		if (pin_idx % 2) {
			// pin index is odd
			*((uint16_t *)pin_cfg) = ((*((uint32_t *)(gpio_a_ctrl_reg_list[(pin_idx >> 1)]))) >> 16) & 0xFFFF;
		} else {
			// pin index is even
			*((uint16_t *)pin_cfg) = (*((uint32_t *)(gpio_a_ctrl_reg_list[(pin_idx >> 1)]))) & 0xFFFF;
		}
		break;
	case PORT_B:
		if (pin_idx % 2) {
			// pin index is odd
			*((uint16_t *)pin_cfg) = ((*((uint32_t *)(gpio_b_ctrl_reg_list[(pin_idx >> 1)]))) >> 16) & 0xFFFF;
		} else {
			// pin index is even
			*((uint16_t *)pin_cfg) = (*((uint32_t *)(gpio_b_ctrl_reg_list[(pin_idx >> 1)]))) & 0xFFFF;
		}
		break;
	case PORT_C:
		if (pin_idx % 2) {
			// pin index is odd
			*((uint16_t *)pin_cfg) = ((*((uint32_t *)(gpio_c_ctrl_reg_list[(pin_idx >> 1)]))) >> 16) & 0xFFFF;
		} else {
			// pin index is even
			*((uint16_t *)pin_cfg) = (*((uint32_t *)(gpio_c_ctrl_reg_list[(pin_idx >> 1)]))) & 0xFFFF;
		}
		break;
	case PORT_D:
		if (pin_idx % 2) {
			// pin index is odd
			*((uint16_t *)pin_cfg) = ((*((uint32_t *)(gpio_d_ctrl_reg_list[(pin_idx >> 1)]))) >> 16) & 0xFFFF;
		} else {
			// pin index is even
			*((uint16_t *)pin_cfg) = (*((uint32_t *)(gpio_d_ctrl_reg_list[(pin_idx >> 1)]))) & 0xFFFF;
		}
		break;
	case PORT_E:
		if (pin_idx % 2) {
			// pin index is odd
			*((uint16_t *)pin_cfg) = ((*((uint32_t *)(gpio_e_ctrl_reg_list[(pin_idx >> 1)]))) >> 16) & 0xFFFF;
		} else {
			// pin index is even
			*((uint16_t *)pin_cfg) = (*((uint32_t *)(gpio_e_ctrl_reg_list[(pin_idx >> 1)]))) & 0xFFFF;
		}
		break;
	case PORT_F:
		if (pin_idx % 2) {
			// pin index is odd
			*((uint16_t *)pin_cfg) = ((*((uint32_t *)(gpio_f_ctrl_reg_list[(pin_idx >> 1)]))) >> 16) & 0xFFFF;
		} else {
			// pin index is even
			*((uint16_t *)pin_cfg) = (*((uint32_t *)(gpio_f_ctrl_reg_list[(pin_idx >> 1)]))) & 0xFFFF;
		}
		break;
	case PORT_S:
		if (pin_idx % 2) {
			// pin index is odd
			*((uint16_t *)pin_cfg) = ((*((uint32_t *)(gpio_s_ctrl_reg_list[(pin_idx >> 1)]))) >> 16) & 0xFFFF;
		} else {
			// pin index is even
			*((uint16_t *)pin_cfg) = (*((uint32_t *)(gpio_s_ctrl_reg_list[(pin_idx >> 1)]))) & 0xFFFF;
		}
		break;
	default:
		break;
	}


	return HAL_OK;
}


/**
 *  @brief To power on (enable) a IO pad .
 *
 *  @param[in]  pin_name  The IO pin.
 *  @param[in]  periphl_id  The ID of the peripheral owns this pin.
 *
 *  @return     HAL_OK:  IO pad power up OK.
 */
SECTION_PINMUX_TEXT
hal_status_t hal_rtl_pin_pwrup(uint32_t pin_name, uint32_t periphl_id)
{
	io_pin_t pin;
	uint32_t port_idx;
	uint32_t pin_idx;
	AON_TypeDef *aon = AON;
	SYSON_S_TypeDef *syson_s = SYSON_S;
	volatile uint32_t val;


	DBG_MISC_INFO("\r\n%s => pin_name = 0x%x, pid = 0x%x\r\n", __func__, pin_name, periphl_id);
	pin.pin_name = pin_name;
	port_idx = pin.pin_name_b.port;
	pin_idx = pin.pin_name_b.pin;

	if (port_idx >= PORT_MAX_NUM) {
		// Internal Port ?
		if (port_idx == PORT_INTERNAL) {
			return HAL_OK;
		} else {
			DBG_MISC_ERR("hal_rtl_pin_pwrup: Unknown port (%u)\r\n", port_idx);
			return HAL_ERR_PARA;
		}
	}

	switch (port_idx) {
	case PORT_A:
		val = aon->AON_REG_AON_PAD_CTRL;
		val &= ~(AON_BIT_AON_GPIOA_PWD33);
		aon->AON_REG_AON_PAD_CTRL = val;
		break;
	case PORT_B:
		val = aon->AON_REG_AON_PAD_CTRL;
		val &= ~(AON_BIT_SYSON_GPIOB_PWD33);
		aon->AON_REG_AON_PAD_CTRL = val;
		break;
	case PORT_C:
		val = aon->AON_REG_AON_PAD_CTRL;
		val &= ~(AON_BIT_SYSON_GPIOC_PWD33);
		aon->AON_REG_AON_PAD_CTRL = val;
		break;
	case PORT_D:
		val = aon->AON_REG_AON_PAD_CTRL;
		val &= ~(AON_BIT_SYSON_GPIOD_PWD33);
		aon->AON_REG_AON_PAD_CTRL = val;
		break;
	case PORT_E:
		val = aon->AON_REG_AON_PAD_CTRL;
		val &= ~(AON_BIT_SYSON_GPIOE_PWD33);
		aon->AON_REG_AON_PAD_CTRL = val;
		break;
	case PORT_F:
		val = aon->AON_REG_AON_PAD_CTRL;
		val &= ~(AON_BIT_PON_GPIOF_PWD33);
		aon->AON_REG_AON_PAD_CTRL = val;
		break;
	case PORT_S:
		val = aon->AON_REG_AON_PAD_CTRL;
		val &= ~(AON_BIT_SYSON_GPIOS_PWD33);
		aon->AON_REG_AON_PAD_CTRL = val;
		break;
	case PORT_DDR:
		val = syson_s->SYSON_S_REG_SYS_DDRPHY_CTRL;
		val |= SYSON_S_BIT_DDRPHY_VCCON;
		syson_s->SYSON_S_REG_SYS_DDRPHY_CTRL = val;
		break;
	default:
		break;
	}
	ppinmux_manager->pinmux_pwr_log[port_idx] |= (1 << pin_idx);


	return HAL_OK;
}


/**
 *  @brief To power down (disable) a IO pad.
 *
 *  @param[in]  pin_name  The IO pin.
 *  @param[in]  periphl_id  The ID of the peripheral owns this pin.
 *
 *  @return     HAL_OK:  IO pad power down OK.
 */
SECTION_PINMUX_TEXT
hal_status_t hal_rtl_pin_pwrdwn(uint32_t pin_name, uint32_t periphl_id)
{
	io_pin_t pin;
	uint32_t port_idx;
	uint32_t pin_idx;
	AON_TypeDef *aon = AON;
	SYSON_S_TypeDef *syson_s = SYSON_S;
	volatile uint32_t val;


	DBG_MISC_INFO("\r\n%s => pin_name = 0x%x, pid = 0x%x\r\n", __func__, pin_name, periphl_id);
	pin.pin_name = pin_name;
	port_idx = pin.pin_name_b.port;
	pin_idx = pin.pin_name_b.pin;

	if (port_idx >= PORT_MAX_NUM) {
		// Internal Port ?
		if (port_idx == PORT_INTERNAL) {
			return HAL_OK;
		} else {
			DBG_MISC_ERR("hal_rtl_pin_pwrdwn: Unknown port (%u)\r\n", port_idx);
			return HAL_ERR_PARA;
		}
	}

