swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_pinmux.c
	ppinmux_manager->pinmux_pwr_log[port_idx] &= ~(1 << pin_idx);
	if (ppinmux_manager->pinmux_pwr_log[port_idx] == 0) {
		switch (port_idx) {
		case PORT_A:
			val = aon->AON_REG_AON_PAD_CTRL;
			val |= (AON_BIT_AON_GPIOA_PWD33);
			aon->AON_REG_AON_PAD_CTRL = val;
			break;
		case PORT_B:
			val = aon->AON_REG_AON_PAD_CTRL;
			val |= (AON_BIT_SYSON_GPIOB_PWD33);
			aon->AON_REG_AON_PAD_CTRL = val;
			break;
		case PORT_C:
			val = aon->AON_REG_AON_PAD_CTRL;
			val |= (AON_BIT_SYSON_GPIOC_PWD33);
			aon->AON_REG_AON_PAD_CTRL = val;
			break;
		case PORT_D:
			val = aon->AON_REG_AON_PAD_CTRL;
			val |= (AON_BIT_SYSON_GPIOD_PWD33);
			aon->AON_REG_AON_PAD_CTRL = val;
			break;
		case PORT_E:
			val = aon->AON_REG_AON_PAD_CTRL;
			val |= (AON_BIT_SYSON_GPIOE_PWD33);
			aon->AON_REG_AON_PAD_CTRL = val;
			break;
		case PORT_F:
			val = aon->AON_REG_AON_PAD_CTRL;
			val |= (AON_BIT_PON_GPIOF_PWD33);
			aon->AON_REG_AON_PAD_CTRL = val;
			break;
		case PORT_S:
			val = aon->AON_REG_AON_PAD_CTRL;
			val |= (AON_BIT_SYSON_GPIOS_PWD33);
			aon->AON_REG_AON_PAD_CTRL = val;
			break;
		case PORT_DDR:
			val = syson_s->SYSON_S_REG_SYS_DDRPHY_CTRL;
			val &= ~(SYSON_S_BIT_DDRPHY_VCCON);
			syson_s->SYSON_S_REG_SYS_DDRPHY_CTRL = val;
			break;
		default:
			break;
		}
	}


	return HAL_OK;
}


/**
 *  @brief To register a IO pin to the pin mux magagement.
 *         The pin mux management will do the checking of pin conflict and pin valid.
 *         And then power up the IO pad.
 *
 *  @param[in]  pin_name  The IO pin.
 *  @param[in]  periphl_id  The ID of the peripheral will use this pin.
 *
 *  @return     HAL_OK:  Pin list register OK.
 *  @return     HAL_ERR_CONFLICT:  Pin conflict. The given pin
 *              is occupied by other peripheral device.
 *  @return     HAL_ERR_HW: the pin is invalid for this IC.
 */
SECTION_PINMUX_TEXT
hal_status_t hal_rtl_pinmux_register(uint32_t pin_name, uint32_t periphl_id)
{
	hal_status_t ret = HAL_OK;


	if (ppinmux_manager == NULL) {
		DBG_MISC_ERR("hal_rtl_pinmux_register: ppinmux_manager is NULL !!\r\n");
		return HAL_ERR_PARA;
	}

	if (ppinmux_manager->pin_reg_func != NULL) {
		ret = (ppinmux_manager->pin_reg_func)(pin_name, periphl_id);
		if (ret != HAL_OK) {
			return ret;
		}
	}

	if (ppinmux_manager->pin_validat_func != NULL) {
		ret = (ppinmux_manager->pin_validat_func)(pin_name, periphl_id);
		if (ret != HAL_OK) {
			return ret;
		}
	}

	if (ppinmux_manager->pin_mux_cfg_func != NULL) {
		ret = (ppinmux_manager->pin_mux_cfg_func)(pin_name, periphl_id);
		if (ret != HAL_OK) {
			return ret;
		}
	}

	if (ppinmux_manager->ioport_pwrup_ctrl_func != NULL) {
		ret = (ppinmux_manager->ioport_pwrup_ctrl_func)(pin_name, periphl_id);
	}


	return ret;
}


/**
 *  @brief Unregister a IO pin from the pin mux management.
 *         The pin mux management will power down the IO pads.
 *
 *  @param[in]  pin_name  The IO pin.
 *  @param[in]  periphl_id  The ID of the peripheral own this pin.
 *
 *  @return     HAL_OK:  Pin unregister OK.
 *  @return     HAL_ERR_PARA:  The peripheral doesn't own this pin.
 */
SECTION_PINMUX_TEXT
hal_status_t hal_rtl_pinmux_unregister(uint32_t pin_name, uint32_t periphl_id)
{
	hal_status_t ret = HAL_OK;


	if (ppinmux_manager == NULL) {
		DBG_MISC_ERR("hal_rtl_pinmux_unregister: ppinmux_manager is NULL !!\r\n");
		return HAL_ERR_PARA;
	}

	if (ppinmux_manager->pin_unreg_func != NULL) {
		ret = (ppinmux_manager->pin_unreg_func)(pin_name, periphl_id);
		if (ret != HAL_OK) {
			return ret;
		}
	}

	if (ppinmux_manager->pin_mux_cfg_func != NULL) {
		// Config pin-mux as GPIO (default function)
		ret = (ppinmux_manager->pin_mux_cfg_func)(pin_name, PID_GPIO);
		if (ret != HAL_OK) {
			return ret;
		}
	}

	if (ppinmux_manager->ioport_pwrdn_ctrl_func != NULL) {
		ret = (ppinmux_manager->ioport_pwrdn_ctrl_func)(pin_name, periphl_id);
	}


	return ret;
}

SECTION_PINMUX_TEXT
void hal_rtl_pinmux_rom_info_copy(uint32_t *p_dst, uint32_t *p_src, const uint32_t size)
{
	uint32_t i = 0;
	if ((p_dst == NULL) || (p_src == NULL)) {
		return;
	}
	if (size == 0) {
		return;
	}
	for (i = 0; i < size; i++) {
		*(p_dst + i) = *(p_src + i);
	}
}

/**
 *  @brief Backup or restore the pinmux info. in ROM.
 *
 *  @param[in]  op  OP_BACKUP or OP_RESTORE.
 *  @param[in]  obj_id  PWR_LOG or REG_LOG.
 *
 *  @returns void
 */
SECTION_PINMUX_TEXT
void hal_rtl_pinmux_rom_info_manage(hal_pin_mux_mang_t *pinmux_manag, uint8_t op, uint8_t obj_id)
{
	if (pinmux_manag == NULL) {
		return;
	}
#if IS_AFTER_CUT_A(CONFIG_CHIP_VER)
	switch (op) {
	case OP_BACKUP:
		if (obj_id == PWR_LOG) {
			hal_rtl_pinmux_rom_info_copy(&(pinmux_pwr_log[0]), &(pinmux_manag->pinmux_pwr_log[0]), PORT_MAX_NUM);
		} else if (obj_id == REG_LOG) {
			hal_rtl_pinmux_rom_info_copy(&(pinmux_reg_log[0]), &(pinmux_manag->pinmux_reg_log[0]), PORT_MAX_NUM);
		} else {
			hal_rtl_pinmux_rom_info_copy(&(pinmux_pwr_log[0]), &(pinmux_manag->pinmux_pwr_log[0]), PORT_MAX_NUM);
			hal_rtl_pinmux_rom_info_copy(&(pinmux_reg_log[0]), &(pinmux_manag->pinmux_reg_log[0]), PORT_MAX_NUM);
		}
		break;
	case OP_RESTORE:
		if (obj_id == PWR_LOG) {
			hal_rtl_pinmux_rom_info_copy(&(pinmux_manag->pinmux_pwr_log[0]), &(pinmux_pwr_log[0]), PORT_MAX_NUM);
		} else if (obj_id == REG_LOG) {
			hal_rtl_pinmux_rom_info_copy(&(pinmux_manag->pinmux_reg_log[0]), &(pinmux_reg_log[0]), PORT_MAX_NUM);
		} else {
			hal_rtl_pinmux_rom_info_copy(&(pinmux_manag->pinmux_pwr_log[0]), &(pinmux_pwr_log[0]), PORT_MAX_NUM);
			hal_rtl_pinmux_rom_info_copy(&(pinmux_manag->pinmux_reg_log[0]), &(pinmux_reg_log[0]), PORT_MAX_NUM);
		}
		break;
	default:
		break;
	}
#endif
}


